In [4]:
# Dependencies
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import requests
from census import Census
import gmaps

# Census & gmaps API Keys
from api_key import (census_api, gkey)
c = Census(census_api, year=2018)

# Configure gmaps
gmaps.configure(api_key=gkey)

In [6]:
# Run Census Search to retrieve data on all cities

louisiana_df = c.acs5.state_place(("NAME", "B01003_001E"),"22","55000")
louisiana_df = pd.DataFrame(louisiana_df)
louisiana_df

                          NAME  B01003_001E state  place
0  New Orleans city, Louisiana     389648.0    22  55000

In [7]:
missouri_df = c.acs5.state_place(("NAME", "B01003_001E"),"29","38000")
missouri_df = pd.DataFrame(missouri_df)
missouri_df

                         NAME  B01003_001E state  place
0  Kansas City city, Missouri     481417.0    29  38000

In [8]:
texas_df = c.acs5.state_place(("NAME", "B01003_001E"),"48","19000")
texas_df = pd.DataFrame(texas_df)
texas_df

                 NAME  B01003_001E state  place
0  Dallas city, Texas    1318806.0    48  19000

In [9]:
oregon_df = c.acs5.state_place(("NAME", "B01003_001E"),"41","59000")
oregon_df = pd.DataFrame(oregon_df)
oregon_df

                    NAME  B01003_001E state  place
0  Portland city, Oregon     639387.0    41  59000

In [10]:
virginia_df = c.acs5.state_place(("NAME", "B01003_001E"),"51","14968")
virginia_df = pd.DataFrame(virginia_df)
virginia_df

                             NAME  B01003_001E state  place
0  Charlottesville city, Virginia      47042.0    51  14968

In [11]:
illinois_df = c.acs5.state_place(("NAME", "B01003_001E"),"17","14000")
illinois_df = pd.DataFrame(illinois_df)
illinois_df

                     NAME  B01003_001E state  place
0  Chicago city, Illinois    2718555.0    17  14000

In [12]:
colorado_df = c.acs5.state_place(("NAME", "B01003_001E"),"08","20000")
colorado_df = pd.DataFrame(colorado_df)
colorado_df

                    NAME  B01003_001E state  place
0  Denver city, Colorado     693417.0    08  20000

In [13]:
sdakota_df = c.acs5.state_place(("NAME", "B01003_001E"),"46","59020")
sdakota_df = pd.DataFrame(sdakota_df)
sdakota_df

                             NAME  B01003_001E state  place
0  Sioux Falls city, South Dakota     174151.0    46  59020

In [14]:
nevada_df = c.acs5.state_place(("NAME", "B01003_001E"),"32","40000")
nevada_df = pd.DataFrame(nevada_df)
nevada_df

                     NAME  B01003_001E state  place
0  Las Vegas city, Nevada     626637.0    32  40000

In [15]:
california_df = c.acs5.state_place(("NAME", "B01003_001E"),"06","67000")
california_df = pd.DataFrame(california_df)
california_df

                             NAME  B01003_001E state  place
0  San Francisco city, California     870044.0    06  67000

In [16]:
tennessee_df = c.acs5.state_place(("NAME", "B01003_001E"),"47","14000")
tennessee_df = pd.DataFrame(tennessee_df)
tennessee_df

                          NAME  B01003_001E state  place
0  Chattanooga city, Tennessee     177365.0    47  14000

In [17]:
massachusetts_df = c.acs5.state_place(("NAME", "B01003_001E"),"25","07000")
massachusetts_df = pd.DataFrame(massachusetts_df)
massachusetts_df

                         NAME  B01003_001E state  place
0  Boston city, Massachusetts     679413.0    25  07000

In [18]:
city_data = louisiana_df.append([missouri_df,oregon_df,massachusetts_df, tennessee_df, virginia_df, california_df, colorado_df, sdakota_df, nevada_df, illinois_df, texas_df])
city_data = city_data.rename(columns={"B01003_001E": "Population",
                                      "NAME": "City, State",
                                      "state": "State Number",
                                     })
city_data

                      City, State  Population State Number  place
0     New Orleans city, Louisiana    389648.0           22  55000
0      Kansas City city, Missouri    481417.0           29  38000
0           Portland city, Oregon    639387.0           41  59000
0      Boston city, Massachusetts    679413.0           25  07000
0     Chattanooga city, Tennessee    177365.0           47  14000
0  Charlottesville city, Virginia     47042.0           51  14968
0  San Francisco city, California    870044.0           06  67000
0           Denver city, Colorado    693417.0           08  20000
0  Sioux Falls city, South Dakota    174151.0           46  59020
0          Las Vegas city, Nevada    626637.0           32  40000
0          Chicago city, Illinois   2718555.0           17  14000
0              Dallas city, Texas   1318806.0           48  19000

In [19]:
# Save as a csv
# Note to avoid any issues later, use encoding="utf-8"
city_data.to_csv("census_data.csv", encoding="utf-8", index=False)